{"title":{"0":"Codeup Start Dates for March 2022","1":"VET TEC Funding Now Available For Dallas Veterans","2":"Dallas Campus Re-opens With New Grant Partner","3":"Codeup Dallas Open House","4":"Codeup’s Placement Team Continues Setting Records","5":"IT Certifications 101: Why They Matter, and Why They Don’t","6":"A rise in cyber attacks means opportunities for veterans in San Antonio","7":"Use your GI Bill® benefits to Land a Job in Tech","8":"Which program is right for me: Cyber Security or Systems Engineering?","9":"What the Heck is System Engineering?","10":"From Speech Pathology to Business Intelligence","11":"Boris – Behind the Billboards","12":"Is Codeup the Best Bootcamp in San Antonio…or the World?","13":"Codeup Launches First Podcast: Hire Tech","14":"Why Should I Become a System Administrator?","15":"Announcing our Candidacy for Accreditation!","16":"Codeup Takes Over More of the Historic Vogue Building","17":"Inclusion at Codeup During Pride Month (and Always)"},"article_content":{"0":["Jan 26, 2022 | Codeup News","As we approach the end of January we wanted to look forward to our next start dates for all of our current programs.","Full Stack Web Development is the first program we built and also our most popular. You’ve asked and we listened! Our next Web Development cohort will start on 3\/7\/2022 and is ENTIRELY VIRTUAL! THESE SEATS WILL GO FAST!","As one of the most in-demand jobs in the country, software and web development is the tech career with the newest jobs. In the U.S., there’s:"," ","Our first new Data Science class of 2022 starts Monday 3\/22\/2022 at our downtown campus at the Vogue building.","Why consider pivoting careers to Data Science?","The supply of data scientists remains painfully low compared to the outrageous demand. YOU can help close the gap while launching a fulfilling, secure, and high-paying career – one of the very best in the country!","Employers are scrambling to find talent due to a lack of qualified applicants. YOU can help fill the gap while future-proofing your skillset. Have the flexibility, security, and salary that you’ve always wanted in a career.","Are you ready to launch your career in tech? Apply today so our admissions team can save your seat and get your name on the list. Our application can be found here. ","Want to experience Codeup early? Join one of our workshops to get an intro to a specific coding language, learn about our financing options, or maybe even code yourself a resume! All of our events can be located here. ","We can’t wait to help you launch your career in tech!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"1":["Jan 7, 2022 | Codeup News, Dallas Newsletter, Featured, Tips for Prospective Students","We are so happy to announce that VET TEC benefits are now available to be used at our campus located in Dallas, TX! Our next Dallas start date for our web development program is January 31st, 2022!","You don’t want to delay your application as this type of funding is limited. Apply now here for our web development program and note you are interested in using VET TEC."," ","We’re hosting a VET TECH workshop next Wednesday evening at our Dallas Campus to discuss everything about this new funding option for our Dallas Veterans.","We’re one of the few coding bootcamps in Dallas approved for the use of VET TEC funding, so this workshop will go over why Codeup is the best place to use your benefits and help launch your career in tech once you’re out of the military. ","Details about the event and the link to grab your free tickets can be found here. ","The VET TEC program details and eligibility requirements are listed below. You can also visit our VET TEC program page here."," ","VET TEC, which stands for Veteran Employment Through Technology Education Courses, is a program through the VA that matches career accelerators like Codeup with veterans looking to gain high-tech skills. Programs like Codeup will help you build the skills you need to become, for example, a Web Developer, while the VA helps you to pay for the tuition."," ","To qualify for VET TEC, you must:","1. Not be on active duty or are within 180 days of separating from active duty2. Qualify for VA Education Assistance under the GI Bill3. Have at least one day of unexpired GI Bill® entitlement"," ","VET TEC renews its funding on an annual cycle in October. ","IMPORTANT: Funds run out very quickly each year. If you’re interested in using VET TEC, we recommend applying immediately and going through our admissions process as quickly as possible. That way, you’ll be accepted early and we can certify your enrollment as soon as VET TEC funding becomes available from the VA.","Don’t delay your access to VET TEC funding and apply today! ","","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"2":["Dec 30, 2021 | Codeup News, Featured","We are happy to announce that our Dallas campus re-opened! Better yet, we have a new grant partner that can fund up to $15,000 in tuition for eligible students. Are you a DFW resident who:","Our next Web Development class starts January 31st, 2022, and will be the first class in-person in two years! Hands-on experience and learning side-by-side with your fellow classmates is an experience hard to duplicate virtually. COVID-19 protocols are in place to keep all students and staff safe while attending the campus in person. Are you ready to start a new career in the New Year!? Seats are limited, so apply now here or email admissions@codeup.com for more info!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"3":["Nov 30, 2021 | Dallas Newsletter, Events","Come join us for the re-opening of our Dallas Campus with some drinks and snacks at Codeup! Curious about what our campus looks like? Click here to register for free","Come join us for the re-opening of our Dallas Campus with some drinks and snacks at Codeup!","Curious about what our campus looks like? Interested in our Web Development Career Accelerator? Keen to chat with an instructor or financial aid rep?","At our Open House, we are here to answer all your questions!","Meet a Codeup instructor, who can help explain what’s taught in our classes and answer questions.","Understand how to join one of our upcoming cohort ( Dec. 6th).","Don’t miss this opportunity to learn more about how you can start the new year transitioning into a new, exciting career in tech. We’re here to answer any questions you may have about Codeup and your future.","Take the first step of your new career today and create your tomorrow!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"4":["Nov 19, 2021 | Codeup News, Employers","Who exactly got hired and where? Check out the list below!","Curious what it’s like to hire a Codeup graduate? Check out our hiring process here.","Want to land a life changing career like these students did? Check our list of programs offered here.","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"5":["Nov 18, 2021 | IT Training, Tips for Prospective Students","AWS, Google, Azure, Red Hat, CompTIA…these are big names in IT! And not only for their products, but also for the certifications they offer. If you’re new to tech, you might be wondering: Do certifications really matter? Welcome to IT Certifications 101! What’s the tl;dr? Certifications are critical to getting past HR for certain roles, but they won’t get you the job.","Certifications are official credentials given by companies, institutions, and vendors to verify that you have demonstrated a specific knowledge or skill. They are a stamp of approval from a known brand (like Amazon) saying “This person knows their stuff.” Certs are used in a lot of industries, including technology. Even within tech, there are dozens of vendors and hundreds of certs.","Many roles (including security, system administration, and networking) require certain certs to make it in the door of an interview process. This filter matters for several reasons: it helps narrow down the pool of applicants, it establishes a baseline of shared knowledge or experience across all applicants, and it expedites the process so that employers don’t have to spend as much time vetting basic technical skills.","Obtaining certs in IT will provide you with a number of benefits:","At the end of the day, certifications are just pieces of paper. They represent your ability to pass a test, not to do a job. Sometimes those things are one and the same, but usually, they are very different. Certifications are like the entrance fee to get into a tournament: you still need to fight your way to the top. And when you’re standing in the ring, it’s better to know how to fight than to have a degree in fighting.","Additionally, not all jobs within tech care about certifications at all. For example, there is technically a Java programming certification from Oracle, but it’s almost never required or considered for job applications because it tests very specific, abnormal, and academic concepts that don’t apply to most real-world software development.","At Codeup, we like to think of our IT training as CertificationsPLUS, as in – you get certifications PLUS hands-on experience. Here’s a quick way to think about it: Amazon Web Services has basic certifications called Cloud Practitioner and Solutions Architect Associate. The official Amazon training for these certs is 1 week: 4 days of training and 1 day of exam readiness. The 1-week schedule will present to you mostly everything you need to pass the certification exam, and then it’s on you to go cram and memorize to get ready. Once you pass, you’ll have the cert, but you’ll be a paper tiger: all bark and no bite. In other words, you’ll appear knowledgeable and skillful on paper, but in reality, you won’t have any experience or know-how for completing the real work.","Alternatively, Codeup spends 5 weeks on AWS, combining exam study and hands-on practice. That way, you can talk the talk and walk the walk.","If you want to learn more about IT certification and training paths, reach out to us at info@codeup.com!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"6":["Nov 17, 2021 | Cybersecurity","In the last few months, the US has experienced dozens of major cyberattacks against leading organizations like Accenture, the NBA, and Kia Motors. Similar attacks are on the rise. This year, 38% more companies have experienced cyber attacks as compared to last year. Often, they involve a ransom payment in order to re-access stolen files. The amount paid by these victims has increased by 300%. In our headquarters of San Antonio, Texas, even local organizations are at risk. Recently, Judson ISD paid a $500,000 ransom.","In 2020, there were over 300,000 open roles for cybersecurity professionals in the US. To add to that, the US Bureau of Labor Statistics predicts a 31% increase in Information Security roles in the upcoming years. As attacks are on the rise, the demand for cybersecurity professionals is quickly increasing. But with so many open roles, the issue isn’t demand – it’s supply.","Luckily, San Antonio is already a national leader in cybersecurity. We have over 16,000 employees in the field, which is the most certified cyber professionals outside of D.C.. With industry giants like USAA and Lockheed Martin in the city, we have a good footing over much of the country. Moreover, San Antonio is Military City, USA. We’re home to one of the largest populations of bases, veterans, and active service members in the country. With both these backgrounds, the city is well-positioned to continue to lead our country’s defense – not just traditionally, but in cyber warfare as well. ","But we still need more help. What can we do about it? Train more cybersecurity professionals. Organizations like Project Quest have supported cybersecurity training for years. But we can’t rely solely on non-profit funding. There are plenty of opportunities for veterans to enter the field with VA benefits. Training programs like Codeup Cloud Academy are approved to accept GI Bill® and Vocational Rehab. This allows veterans to receive housing support while getting the cybersecurity training they need in our Cyber Cloud program.","Want to keep San Antonio safe and positioned as a leader in Cybersecurity? Help us train the next generation of cybersecurity professionals! Connect us with veterans in your network so we can all help continue San Antonio’s tradition of protecting our city and country!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"7":["Nov 4, 2021 | Codeup News, Tips for Prospective Students","As the end of military service gets closer, many transitioning service members often ask, “Can the GI Bill® pay for a coding bootcamp?” The answer is yes, but only if the coding bootcamp is on the VA-approved list.","The GI Bill® will pay for college or a VA-approved coding bootcamp. For bootcamp programs, the VA uses a formula to calculate how much time to deduct from your benefits based on the program’s tuition and how it compares to average college costs.","That’s good news for veterans looking for a second career in the technology sector. The tech industry is fast-paced, action-oriented, and often focused on completing small goals to accomplish large ones, a familiar process for those trained by the military. With average salaries for entry-level programmers averaging around $80,000, it’s a great time to learn how to code and get paid for your expertise.","You could always attend a two- or four-year college degree program in computer science and learn software development. Or you could train for these jobs by completing a specialized bootcamp program.","Coding bootcamps teach widely used programming languages and frameworks like Ruby on Rails, Python on Django, JavaScript, and PHP stacks through project-based learning. Students graduate from bootcamps with a portfolio, an online presence, interview skills, and more. Most courses even help graduates find an internship or match students with an employer network.","A bootcamp is an immersive, intense full-time learning environment. Students should prepare to scale back outside activities and give up full-time employment for the program’s course. Coding bootcamps vary in length from six to 28 weeks, although the average time is about 14 weeks long. Military service members transitioning from active duty to veteran status can often leverage terminal leave to attend a coding bootcamp.","If you’re still wondering whether to choose a college program or a tech career accelerator, here are some points to consider:","A tech workforce development program usually translates into extensive, hands-on instruction in say, learning how to write code in less time than it takes to complete a two- or four-year degree program. Some bootcamps may be offered through established state or private universities, while some private providers offer training programs.","Texas-based Codeup offers accelerated programs in San Antonio, Austin, Dallas, and Houston to help you launch your tech career. No previous experience is needed to participate in any of Codeup’s accelerator programs, all of which are GI Bill® eligible.","Apply to Codeup’s full-stack web development to learn how to create an app or website from start to finish using today’s coding languages in just 20 weeks.Apply to Codeup’s systems engineering bootcamp if you’re up for problem-solving in information technology in this 13-week accelerator.Apply to Codeup’s data science bootcamp if you’d like to be a data scientist and learn how to apply machine learning models to make predictions and turn your insights into actionable recommendations over the course of 20 weeks.","You’ll also get professional job application counseling and support as an ongoing part of our curriculum, which continues even after graduation. Veterans and their dependents may also apply for a Codeup scholarship to offset the amount of VA benefits used for tuition.","Codeup’s job guarantee means you’ll get hired for a tech job you’ve trained for within six months of graduating or receive a refund of 100% of your tuition.","For more information on Codeup’s GI Bill® eligible bootcamp programs, reach out to one of our admissions specialists for more details or call us at 210-802-7289.","Contributing Author Iris Gonzalez.","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"8":["Oct 28, 2021 | IT Training, Tips for Prospective Students","If you’re thinking about a career in IT, there are a lot of directions you could go. You could become a web developer or data scientist or study UI\/UX and graphic design. Or for those of you reading right now, you might be looking at entering a career in networking, cybersecurity, or cloud administration. Which might lead you to ask: what’s the difference, and which program is right for me?","Both these programs are 13-weeks long. While they have different names, they share a lot of similar content as entry-level IT accelerators. Of the seven technical modules, four of them are shared. Both cover:","Networking, Linux, Windows, and AWS are a LOT of content for new IT employees. Outside of this content, the programs split into their areas of focus:","Now that you understand where the programs are similar and where they differ, which one is right for you? Here are some questions to consider:","If you don’t have any work or education in IT, the Systems Engineering program is the one for you. It is designed to be the 0-1 step in your IT career to get you started! If you do have work experience or education in IT, then you might be interested in Cyber Cloud. Why is that?","Our programs focus on CompTIA certifications, which is a major industry provider in technical training. The typical track through their IT certifications is to start with their A+, then complete their Network +, and then progress to their Security +. That means if you don’t have your Network + (or relevant experience), it can be really hard to catch up.","Still not sure which is right for you? Try it out for yourself with this free Network Fundamentals Crash Course. Ready to get some questions answered? Request More Information Here","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"9":["Oct 21, 2021 | IT Training, Tips for Prospective Students","Codeup offers a 13-week training program: Systems Engineering. Designed to help you launch your career in tech, this program takes you from 0 experience to IT hero with certifications and hands-on experience in just weeks. But if you’re new to tech, you might be wondering…what is Systems Engineering?","In IT terms, a Systems Engineer (Sysadmin or Sysad for short) is responsible for the configuration, upkeep, and operation of computer systems. They manage things like security, storage, automation, troubleshooting, and a whole lot more. For example, some of the day to day tasks include things like:","You might be thinking, “Woah, that looks like a lot!” and that’s because it is! A Systems Engineer is a critical piece of IT infrastructure. And in today’s digital age, all companies are IT companies, which means Sysadmins are critical everywhere. You can think of a Sysad as a jack-of-all-trades of what we typically think of as IT. But don’t forget how the old saying actually ends: “A jack of all trades is a master of none, but oftentimes better than a master of none.” So, what are the skills a Sysadmin uses?","Now you know what a Sysadmin does and what skills they use. But why become a Sysadmin? The world is increasingly dependent on computer systems and their underlying technologies. Configuring computer software, designing innovative solutions for specific problems, and basic troubleshooting skills are more and more in demand each year.  Without systems engineers, the technical world would stop innovating and become stagnant.","Interested in learning more? Sign up for our Network Fundamentals Crash Course to get a taste for these skills – a $500 value you can get for free!Ready to go all-in? Apply to our 13-week Systems Engineering program where you’ll earn your Network+ and Linux+ certifications, along with skills in AWS, LAMP, Microsoft, and more!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"10":["Oct 18, 2021 | Alumni Stories","Before Codeup, I was a home health Speech-Language Pathologist Assistant. I would go from home to home working with children anywhere from 1 year old to 18 years old. After 5 years of the profession, my body was getting tired driving around all the time and I felt overworked. The work was satisfying and I do miss working with the kiddos, but I just felt drained. I knew it was time to find a different field, so I started thinking about what else I was good at.","Then one day as I was on my way to a patient’s home, I found a Codeup billboard near Splashtown that said “drive to a job you love” and I took it as a sign. I thought, “I want to drive to a job I love!” I had also heard nothing but good things about Codeup from a friend that went the Web Development route. She answered my questions and helped me through the whole process.","At first, I was a little worried about tuition payment, but once I got started in the application process, they held Zoom meetings where they would talk about all the funding options. They made it really easy and addressed all of my concerns. I realized I didn’t have to be scared about the financial aspect. I applied to a couple of grants and was able to get about a third of my tuition covered through the Train for Jobs SA grant from Workforce Solutions Alamo. That really helped me. I also received a few different scholarships from Codeup. The rest of it was a loan from Meritize.","It was difficult leaving something I was comfortable and familiar with to start something new with no data science background, but I have always enjoyed all things tech. Once we got into the pre-assessment work and then the prework leading up to class, it showed me, “okay this IS what I wanted to be doing.” I really enjoyed it, thought it was fun, and realized this was for me.","Overall, I really enjoyed the program. We were in Zoom the whole time because of the pandemic, but they made it slow, nice, and easy. The instructors are absolutely wonderful. Every single instructor helped me at one point or another, teaching things from ground zero and explaining everything really nicely in a way I can understand. One thing I value the most about the instructors is that, not only do they go over all the necessary skills needed in a data-related career, but they teach us how to learn the skills as well. They didn’t just give us the work and tell us exactly how to do it. They provide instruction, hands-on exercises\/projects, and answers to all questions, but most importantly, they walk us through how to work with the data and obtain the answers on our own. This is extremely valuable as I believe it is the key to success in this field.","Now after graduating from Codeup, I’m a Business Intelligence Analyst at Liquid Web. I’ve been here almost three months now and I’m contributing to so many projects. I really feel like a true member of the team. I can figure things out for myself and my bosses are telling me how well I’m doing and how far I’ve come since working here. I didn’t have to ask for much help or training, because Codeup prepared me well and taught me how to learn when I run into skills they don’t teach. It’s been really good.","I’m so glad I made this change. It was scary to take that leap of faith, but ultimately, I’m really glad I did. I love my job and I love what I’m doing. If anyone is looking to make a career change and struggling to find their best fit, I recommend looking into Codeup and going through their process. I’m extremely happy where I am right now and wouldn’t change a thing.","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"11":["Oct 3, 2021 | Behind the Billboards","\n","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"12":["Sep 16, 2021 | Codeup News, Featured","Looking for the best data science bootcamp in the world? Or how about the best coding bootcamp in San Antonio? If you’re reading this, you’ve found both! We are thrilled to announce that Codeup has been chosen as a Best Data Science Bootcamp of 2021 by Course Report, and a Best San Antonio Coding Bootcamp 2021 by Career Karma.","Course Report is a leading authority in ranking and reviewing bootcamps. Every year, they compile a list of the Best Data Science Bootcamps in the world. Codeup made the 2021 list, along with 21 other bootcamps, for our Data Science program. Why? Course Report considers alumni and student reviews, financing options, outcome transparency, and duration of the program. More on how Codeup performs in each of those categories below!","The folks at Career Karma are experts on what the best bootcamps are for various tech careers. They’ve recently identified the 10 Best Coding Bootcamps in San Antonio in 2021 with Codeup in the top 5 for our Web Development program. Also on the list is Open Cloud Academy, which is now Codeup Cloud Academy (CCA), owned and operated by us. The CCA programs recognized are cybersecurity and Systems Engineering.","Here are a few reasons why Codeup is one of the best bootcamps in San Antonio and the world:","These awards are huge for the security and confidence they provide our students and employer partners. If you’re an employer looking to hire from the best bootcamp, now you know where to find high-quality talent. If you’re interested in a career change into tech, now you know where to apply to get the best experience. ","Special shoutouts are in order to every single person on our incredible staff. It is an honor to be recognized not just locally, but globally! If you’d like to work at an award-winning institution, now you know where you can join a well-oiled machine and make a huge impact. We’re hiring!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"13":["Aug 25, 2021 | Codeup News, Featured","Any podcast enthusiasts out there? We are pleased to announce the release of Codeup’s first podcast, Hire Tech! Hire Tech is a conversation with new developers and the people that hire them, hosted by our CEO and Co-Founder, Jason Straughan. ","In a world where “entry-level” positions often require 3 years of experience, Jason sets out to discover what it’s like to break into and work in the modern tech industry. To hear various perspectives, he interviews both Codeup alumni and tech leaders who have hired from Codeup. These stories show you the impact Codeup has on the tech world by empowering our community with real life change.","In the first episode, Jason interviews Codeup alum Ryan Smith, who has been working as a Software Developer and Software Engineer for nearly two years. From a missionary in Colombia to a Dog Handler in Afghanistan, Ryan’s life experiences are one of the many ways he and other Codeup grads stand out to employers. That, paired with his interview preparation trick. Listen in to learn what it is!","This episode will reveal how he went into his job search with total confidence, what he would tell hiring managers regarding junior-level talent, and why they shouldn’t get caught up on an applicant not knowing their primary language. Give it a listen on Spotify. Also available on Apple Podcasts, Anchor, and Google Podcasts, it’s perfect for your morning commute!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"14":["Aug 23, 2021 | IT Training, Tips for Prospective Students","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"15":["Jun 30, 2021 | Codeup News","Did you know that even though we’re an independent school, we have multiple regulating bodies that verify our processes and results? For starters, we’re licensed and regulated by the Texas Workforce Commission. We’re also approved by the SAA Texas Veterans Commission to accept VA Benefits, and audited by the Council for Integrity in Results Reporting. This already gives us a premier status and a trusted brand name. But there’s one missing piece that would take us to the next level: an accrediting body. Now, we’re well on our way there! We are proud to announce that, effective May 2021,  Codeup is a Candidate for Accreditation by The Middle States Association Commission on Secondary Schools (MSA-CSS), which is located at 3624 Market Street, Philadelphia, PA 19104 (Phone: 267-284-5000).","Accrediting bodies provide guidance and best practices for institutions like Codeup, and verify the quality of our education. The MSA-CSS in particular is recognized by the U.S. Secretary of Education. Getting accredited by them would allow us to establish eligibility to participate in federal Title IV student loan programs for adult students. This could be huge for our applicants, as it would significantly expand access to financial aid and allow even more people to change their lives by launching a tech career at Codeup. We would also be the first and only career accelerator with MSA-CSS accreditation in Texas. One article even states that coding bootcamps, in general, are not accredited.","Currently, we are a candidate for accreditation, and not yet accredited. (Establishing candidacy is in itself a big feat, and a little bird told us our application was in the top 1% over at least the last 15 years!) Now that we’re candidates, we are actively working with the MSA-CSS to meet or exceed the requirements for accreditation. This process usually takes 18-24 months. Once approved, it would be an additional 12-18 months for Title IV acceptance, which is what would enable students to receive federal loans.","As the Premier Career Accelerator in Texas, we are thrilled about this news. Adding this layer of compliance and quality assurance will significantly improve the quality of education we provide and the way that we provide it. It will help us abide by our core values of Delivering Excellence, Acting with Integrity, Cultivating Inclusive Growth, and Being Helpful. It will help us live out our mission of empowering life change on a bigger and better scale, so that we can continue to be the #1 option for Texans looking to launch a career in tech!","Not familiar with Codeup? Get to know our core values, mission, and all about us.Curious about our verified results? Check out our CIRR and TWC outcome reports.","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"16":["Jun 21, 2021 | Codeup News, Featured","Codeup is moving into another floor of our Historic Vogue building in Downtown San Antonio! We’ve gone from a humble beginning in the middle of a coworking space called Geekdom, to now having three floors of our own in our favorite downtown building.","Codeup has a campus in Dallas, classrooms in the Rackspace Castle in San Antonio, and offices in Houston and Austin. But Downtown San Antonio is where we were born and raised, and where we’ve planted our flag for our headquarters. While other Texas cities are becoming known for tech, San Antonio never has been. This is the city where we can make the biggest impact on the local tech scene. We’re supplying companies with the in-demand tech talent that has been missing locally while changing lives by launching San Antonians into these tech careers. ","The SA Tech District is growing downtown and the historic Vogue building is in the heart of it all! We’ve been part of that action for 7 years and in the Vogue Building for 6 of them. Changing careers is a lot of work, both on our staff and students. We want to have fun while doing it! We need an upbeat atmosphere where we can stay plugged into San Antonio and engaged in the tech scene. Steps away from the Majestic Theater, the Riverwalk, and our old home at Geekdom, our students and staff have a location to be excited about. ","During the pandemic, our staff doubled in size and we’ve outgrown our two floors. As we invite our staff back to working in-office, they need to be able to fit. By expanding into the second floor, our staff will have breathing room and ample space for social distancing. Our classrooms will stay on the 6th floor, where students get the best views of downtown. ","If you want to get plugged into the San Antonio tech scene, you’ve got options with Codeup! Launch a career in tech as a web developer, data scientist, system administrator, or cyber cloud specialist. Work in the office with us by joining our staff. Or, hire our grads. Hope to see you at the Vogue someday!","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"],"17":["Jun 4, 2021 | Codeup News","Happy Pride Month! Pride Month is a dedicated time to celebrate and support the LGBTQIA+ community. At Codeup, one of our core values is Cultivating Inclusive Growth, something that takes on many shapes, sizes, forms, and colors. From representation in tech to empowering and supporting all, let’s reflect on how we live out this core value for our LGBTQIA+ community, not just during Pride Month, but always.","We’re firm believers that the people making tech should look like the people using it, which is everyone. We’re proud to offer Pride Scholarships year round, which aim to increase, support, and promote representation of the LGBTQIA+ community in tech. However, representation is only one part of cultivating inclusive growth. We want to help create a thriving tech community where everyone feels represented, but also safe and empowered.","In a 2019 survey conducted by Blind, 83% of LGBQ technologists and 78% of trans or gender non-conforming technologists reported that they felt safe in the workplace. In 2020, those numbers dropped to 76% and 64%, respectively. Why the drop? Maybe recent pushes for representation in tech weren’t followed up with efforts to truly cultivate inclusivity and growth.","To cultivate inclusive growth, we don’t stop at representation. We also empower and support our community so that no one feels unsafe. Our internal DEI Taskforce empowers our staff with resources and conversations that aim to create a diverse culture of support, safety, and inclusivity for each other and our students. Equipped with this knowledge, our staff can cultivate inclusive growth from the first time they interact with an applicant all the way until they get placed into a new job. They may have even felt empowered just by seeing our students and staff sporting their Pride t-shirts around town. You can get yours on our merch store! The proceeds support our Pride Scholarship.","Not only do we want the people making tech to look like the people using it, we also want them to feel safe and empowered to do so. If you’re looking for a career in tech, let us empower you every step of the way! First, apply now. Then, apply for our Pride Scholarship.","","","","Submit your email address to gain access to more information about our programs, financial aid, and benefits. We may even send you some free swag!","(210) 802–7289","Why Codeup? Financial Aid Options Student Reviews Employers Refund PolicyFAQsCareersMedia Kit","Full Stack Web Development Data ScienceIT \/ Systems Engineering Free Networking Course"]}}